chenwangqing/Coroutine/Keil/HC32F103/LIB/HC32F10x_StdPeriph_Driver/inc/hc32f10x_tim.h
  uint16_t TIM_AutomaticOutput;  /*!< Specifies whether the TIM Automatic Output feature is enabled or not. 
                                      This parameter can be a value of @ref TIM_AOE_Bit_Set_Reset */
} TIM_BDTRInitTypeDef;

/*************************************************************************
Register Address 
*************************************************************************/
#define TIM1												0x40012C00
#define TIM2												0x40000000
#define TIM3												0x40000400
#define TIM4												0x40000800
#define TIM5												0x40000C00
#define TIM6												0x40000800
#define TIM7												0x40001400
#define TIM8												0x40013400
#define TIM9												0x40014C00
#define TIM10												0x40015000
#define TIM11												0x40015400
#define TIM12												0x40001800
#define TIM13												0x40001C00
#define TIM14												0x40002000
#define TIM15												0x40014000
#define TIM16												0x40014400
#define TIM17												0x40014800

#define TIM_CR1(TIMn)								(*(volatile uint32_t *)(uint32_t)(TIMn + 0x00))
#define TIM_CR2(TIMn)								(*(volatile uint32_t *)(uint32_t)(TIMn + 0x04))
#define TIM_SMCR(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x08))
#define TIM_DIER(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x0C))
#define TIM_SR(TIMn)								(*(volatile uint32_t *)(uint32_t)(TIMn + 0x10))
#define TIM_EGR(TIMn)								(*(volatile uint32_t *)(uint32_t)(TIMn + 0x14))
#define TIM_CCMR1(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x18))
#define TIM_CCMR2(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x1C))
#define TIM_CCER(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x20))
#define TIM_CNT(TIMn)								(*(volatile uint32_t *)(uint32_t)(TIMn + 0x24))
#define TIM_PSC(TIMn)								(*(volatile uint32_t *)(uint32_t)(TIMn + 0x28))
#define TIM_ARR(TIMn)								(*(volatile uint32_t *)(uint32_t)(TIMn + 0x2C))
#define TIM_RCR(TIMn)								(*(volatile uint32_t *)(uint32_t)(TIMn + 0x30))
#define TIM_CCR1(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x34))
#define TIM_CCR2(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x38))
#define TIM_CCR3(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x3C))
#define TIM_CCR4(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x40))
#define TIM_BDTR(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x44))
#define TIM_DCR(TIMn)								(*(volatile uint32_t *)(uint32_t)(TIMn + 0x48))
#define TIM_DMAR(TIMn)							(*(volatile uint32_t *)(uint32_t)(TIMn + 0x4C))


#define TIM_OCMode_Timing                  ((uint16_t)0x0000)
#define TIM_OCMode_Active                  ((uint16_t)0x0010)
#define TIM_OCMode_Inactive                ((uint16_t)0x0020)
#define TIM_OCMode_Toggle                  ((uint16_t)0x0030)
#define TIM_OCMode_PWM1                    ((uint16_t)0x0060)
#define TIM_OCMode_PWM2                    ((uint16_t)0x0070)


#define TIM_OPMode_Single                  ((uint16_t)0x0008)
#define TIM_OPMode_Repetitive              ((uint16_t)0x0000)


#define TIM_Channel_1                      ((uint16_t)0x0000)
#define TIM_Channel_2                      ((uint16_t)0x0004)
#define TIM_Channel_3                      ((uint16_t)0x0008)
#define TIM_Channel_4                      ((uint16_t)0x000C)


#define TIM_CKD_DIV1                       ((uint16_t)0x0000)
#define TIM_CKD_DIV2                       ((uint16_t)0x0100)
#define TIM_CKD_DIV4                       ((uint16_t)0x0200)

#define TIM_CounterMode_Up                 ((uint16_t)0x0000)
#define TIM_CounterMode_Down               ((uint16_t)0x0010)
#define TIM_CounterMode_CenterAligned1     ((uint16_t)0x0020)
#define TIM_CounterMode_CenterAligned2     ((uint16_t)0x0040)
#define TIM_CounterMode_CenterAligned3     ((uint16_t)0x0060)


#define TIM_OCPolarity_High                ((uint16_t)0x0000)
#define TIM_OCPolarity_Low                 ((uint16_t)0x0002)

  
#define TIM_OCNPolarity_High               ((uint16_t)0x0000)
#define TIM_OCNPolarity_Low                ((uint16_t)0x0008)


#define TIM_OutputState_Disable            ((uint16_t)0x0000)
#define TIM_OutputState_Enable             ((uint16_t)0x0001)


#define TIM_OutputNState_Disable           ((uint16_t)0x0000)
#define TIM_OutputNState_Enable            ((uint16_t)0x0004)


#define TIM_CCx_Enable                      ((uint16_t)0x0001)
#define TIM_CCx_Disable                     ((uint16_t)0x0000)

#define TIM_CCxN_Enable                     ((uint16_t)0x0004)
#define TIM_CCxN_Disable                    ((uint16_t)0x0000)


#define TIM_Break_Enable                   ((uint16_t)0x1000)
#define TIM_Break_Disable                  ((uint16_t)0x0000)


#define TIM_BreakPolarity_Low              ((uint16_t)0x0000)
#define TIM_BreakPolarity_High             ((uint16_t)0x2000)


#define TIM_AutomaticOutput_Enable         ((uint16_t)0x4000)
#define TIM_AutomaticOutput_Disable        ((uint16_t)0x0000)


#define TIM_LOCKLevel_OFF                  ((uint16_t)0x0000)
#define TIM_LOCKLevel_1                    ((uint16_t)0x0100)
#define TIM_LOCKLevel_2                    ((uint16_t)0x0200)
#define TIM_LOCKLevel_3                    ((uint16_t)0x0300)


#define TIM_OSSIState_Enable               ((uint16_t)0x0400)
#define TIM_OSSIState_Disable              ((uint16_t)0x0000)


#define TIM_OSSRState_Enable               ((uint16_t)0x0800)
#define TIM_OSSRState_Disable              ((uint16_t)0x0000)


#define TIM_OCIdleState_Set                ((uint16_t)0x0100)
#define TIM_OCIdleState_Reset              ((uint16_t)0x0000)


#define TIM_OCNIdleState_Set               ((uint16_t)0x0200)
#define TIM_OCNIdleState_Reset             ((uint16_t)0x0000)


#define  TIM_ICPolarity_Rising             ((uint16_t)0x0000)
#define  TIM_ICPolarity_Falling            ((uint16_t)0x0002)
#define  TIM_ICPolarity_BothEdge           ((uint16_t)0x000A)


#define TIM_ICSelection_DirectTI           ((uint16_t)0x0001) /*!< TIM Input 1, 2, 3 or 4 is selected to be 
                                                                   connected to IC1, IC2, IC3 or IC4, respectively */
#define TIM_ICSelection_IndirectTI         ((uint16_t)0x0002) /*!< TIM Input 1, 2, 3 or 4 is selected to be
                                                                   connected to IC2, IC1, IC4 or IC3, respectively. */
#define TIM_ICSelection_TRC                ((uint16_t)0x0003) /*!< TIM Input 1, 2, 3 or 4 is selected to be connected to TRC. */


