chenwangqing/Coroutine/Keil/HC32F103/LIB/HC32F10x_StdPeriph_Driver/inc/hc32f10x_tim.h
#define TIM_OCFast_Enable                  ((uint16_t)0x0004)
#define TIM_OCFast_Disable                 ((uint16_t)0x0000)


#define TIM_OCClear_Enable                 ((uint16_t)0x0080)
#define TIM_OCClear_Disable                ((uint16_t)0x0000)


#define TIM_TRGOSource_Reset               ((uint16_t)0x0000)
#define TIM_TRGOSource_Enable              ((uint16_t)0x0010)
#define TIM_TRGOSource_Update              ((uint16_t)0x0020)
#define TIM_TRGOSource_OC1                 ((uint16_t)0x0030)
#define TIM_TRGOSource_OC1Ref              ((uint16_t)0x0040)
#define TIM_TRGOSource_OC2Ref              ((uint16_t)0x0050)
#define TIM_TRGOSource_OC3Ref              ((uint16_t)0x0060)
#define TIM_TRGOSource_OC4Ref              ((uint16_t)0x0070)


#define TIM_SlaveMode_Reset                ((uint16_t)0x0004)
#define TIM_SlaveMode_Gated                ((uint16_t)0x0005)
#define TIM_SlaveMode_Trigger              ((uint16_t)0x0006)
#define TIM_SlaveMode_External1            ((uint16_t)0x0007)

#define TIM_MasterSlaveMode_Enable         ((uint16_t)0x0080)
#define TIM_MasterSlaveMode_Disable        ((uint16_t)0x0000)


#define TIM_FLAG_Update                    ((uint16_t)0x0001)
#define TIM_FLAG_CC1                       ((uint16_t)0x0002)
#define TIM_FLAG_CC2                       ((uint16_t)0x0004)
#define TIM_FLAG_CC3                       ((uint16_t)0x0008)
#define TIM_FLAG_CC4                       ((uint16_t)0x0010)
#define TIM_FLAG_COM                       ((uint16_t)0x0020)
#define TIM_FLAG_Trigger                   ((uint16_t)0x0040)
#define TIM_FLAG_Break                     ((uint16_t)0x0080)
#define TIM_FLAG_CC1OF                     ((uint16_t)0x0200)
#define TIM_FLAG_CC2OF                     ((uint16_t)0x0400)
#define TIM_FLAG_CC3OF                     ((uint16_t)0x0800)
#define TIM_FLAG_CC4OF                     ((uint16_t)0x1000)


#define TIM_DMABurstLength_1Byte           TIM_DMABurstLength_1Transfer
#define TIM_DMABurstLength_2Bytes          TIM_DMABurstLength_2Transfers
#define TIM_DMABurstLength_3Bytes          TIM_DMABurstLength_3Transfers
#define TIM_DMABurstLength_4Bytes          TIM_DMABurstLength_4Transfers
#define TIM_DMABurstLength_5Bytes          TIM_DMABurstLength_5Transfers
#define TIM_DMABurstLength_6Bytes          TIM_DMABurstLength_6Transfers
#define TIM_DMABurstLength_7Bytes          TIM_DMABurstLength_7Transfers
#define TIM_DMABurstLength_8Bytes          TIM_DMABurstLength_8Transfers
#define TIM_DMABurstLength_9Bytes          TIM_DMABurstLength_9Transfers
#define TIM_DMABurstLength_10Bytes         TIM_DMABurstLength_10Transfers
#define TIM_DMABurstLength_11Bytes         TIM_DMABurstLength_11Transfers
#define TIM_DMABurstLength_12Bytes         TIM_DMABurstLength_12Transfers
#define TIM_DMABurstLength_13Bytes         TIM_DMABurstLength_13Transfers
#define TIM_DMABurstLength_14Bytes         TIM_DMABurstLength_14Transfers
#define TIM_DMABurstLength_15Bytes         TIM_DMABurstLength_15Transfers
#define TIM_DMABurstLength_16Bytes         TIM_DMABurstLength_16Transfers
#define TIM_DMABurstLength_17Bytes         TIM_DMABurstLength_17Transfers
#define TIM_DMABurstLength_18Bytes         TIM_DMABurstLength_18Transfers


void TIM_DeInit(uint32_t TIMx);
void TIM_TimeBaseInit(uint32_t TIMx, TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct);
void TIM_OC1Init(uint32_t TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_OC2Init(uint32_t TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_OC3Init(uint32_t TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_OC4Init(uint32_t TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_ICInit(uint32_t TIMx, TIM_ICInitTypeDef* TIM_ICInitStruct);
void TIM_PWMIConfig(uint32_t TIMx, TIM_ICInitTypeDef* TIM_ICInitStruct);
void TIM_BDTRConfig(uint32_t TIMx, TIM_BDTRInitTypeDef *TIM_BDTRInitStruct);
void TIM_TimeBaseStructInit(TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct);
void TIM_OCStructInit(TIM_OCInitTypeDef* TIM_OCInitStruct);
void TIM_ICStructInit(TIM_ICInitTypeDef* TIM_ICInitStruct);
void TIM_BDTRStructInit(TIM_BDTRInitTypeDef* TIM_BDTRInitStruct);
void TIM_Cmd(uint32_t TIMx, FunctionalState NewState);
void TIM_CtrlPWMOutputs(uint32_t TIMx, FunctionalState NewState);
void TIM_ITConfig(uint32_t TIMx, uint16_t TIM_IT, FunctionalState NewState);
void TIM_GenerateEvent(uint32_t TIMx, uint16_t TIM_EventSource);
void TIM_DMAConfig(uint32_t TIMx, uint16_t TIM_DMABase, uint16_t TIM_DMABurstLength);
void TIM_DMACmd(uint32_t TIMx, uint16_t TIM_DMASource, FunctionalState NewState);
void TIM_InternalClockConfig(uint32_t TIMx);
void TIM_ITRxExternalClockConfig(uint32_t TIMx, uint16_t TIM_InputTriggerSource);
void TIM_TIxExternalClockConfig(uint32_t TIMx, uint16_t TIM_TIxExternalCLKSource,
                                uint16_t TIM_ICPolarity, uint16_t ICFilter);
void TIM_ETRClockMode1Config(uint32_t TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                             uint16_t ExtTRGFilter);
void TIM_ETRClockMode2Config(uint32_t TIMx, uint16_t TIM_ExtTRGPrescaler, 
                             uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter);
void TIM_ETRConfig(uint32_t TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                   uint16_t ExtTRGFilter);
void TIM_PrescalerConfig(uint32_t TIMx, uint16_t Prescaler, uint16_t TIM_PSCReloadMode);
void TIM_CounterModeConfig(uint32_t TIMx, uint16_t TIM_CounterMode);
void TIM_SelectInputTrigger(uint32_t TIMx, uint16_t TIM_InputTriggerSource);
void TIM_EncoderInterfaceConfig(uint32_t TIMx, uint16_t TIM_EncoderMode,
                                uint16_t TIM_IC1Polarity, uint16_t TIM_IC2Polarity);
void TIM_ForcedOC1Config(uint32_t TIMx, uint16_t TIM_ForcedAction);
void TIM_ForcedOC2Config(uint32_t TIMx, uint16_t TIM_ForcedAction);
void TIM_ForcedOC3Config(uint32_t TIMx, uint16_t TIM_ForcedAction);
void TIM_ForcedOC4Config(uint32_t TIMx, uint16_t TIM_ForcedAction);
void TIM_ARRPreloadConfig(uint32_t TIMx, FunctionalState NewState);
void TIM_SelectCOM(uint32_t TIMx, FunctionalState NewState);
void TIM_SelectCCDMA(uint32_t TIMx, FunctionalState NewState);
void TIM_CCPreloadControl(uint32_t TIMx, FunctionalState NewState);
void TIM_OC1PreloadConfig(uint32_t TIMx, uint16_t TIM_OCPreload);
void TIM_OC2PreloadConfig(uint32_t TIMx, uint16_t TIM_OCPreload);
void TIM_OC3PreloadConfig(uint32_t TIMx, uint16_t TIM_OCPreload);
void TIM_OC4PreloadConfig(uint32_t TIMx, uint16_t TIM_OCPreload);
void TIM_OC1FastConfig(uint32_t TIMx, uint16_t TIM_OCFast);
void TIM_OC2FastConfig(uint32_t TIMx, uint16_t TIM_OCFast);
void TIM_OC3FastConfig(uint32_t TIMx, uint16_t TIM_OCFast);
void TIM_OC4FastConfig(uint32_t TIMx, uint16_t TIM_OCFast);
void TIM_ClearOC1Ref(uint32_t TIMx, uint16_t TIM_OCClear);
void TIM_ClearOC2Ref(uint32_t TIMx, uint16_t TIM_OCClear);
void TIM_ClearOC3Ref(uint32_t TIMx, uint16_t TIM_OCClear);
void TIM_ClearOC4Ref(uint32_t TIMx, uint16_t TIM_OCClear);
void TIM_OC1PolarityConfig(uint32_t TIMx, uint16_t TIM_OCPolarity);
void TIM_OC1NPolarityConfig(uint32_t TIMx, uint16_t TIM_OCNPolarity);
void TIM_OC2PolarityConfig(uint32_t TIMx, uint16_t TIM_OCPolarity);
void TIM_OC2NPolarityConfig(uint32_t TIMx, uint16_t TIM_OCNPolarity);
void TIM_OC3PolarityConfig(uint32_t TIMx, uint16_t TIM_OCPolarity);
void TIM_OC3NPolarityConfig(uint32_t TIMx, uint16_t TIM_OCNPolarity);
void TIM_OC4PolarityConfig(uint32_t TIMx, uint16_t TIM_OCPolarity);
void TIM_CCxCmd(uint32_t TIMx, uint16_t TIM_Channel, uint16_t TIM_CCx);
void TIM_CCxNCmd(uint32_t TIMx, uint16_t TIM_Channel, uint16_t TIM_CCxN);
void TIM_SelectOCxM(uint32_t TIMx, uint16_t TIM_Channel, uint16_t TIM_OCMode);
void TIM_UpdateDisableConfig(uint32_t TIMx, FunctionalState NewState);
void TIM_UpdateRequestConfig(uint32_t TIMx, uint16_t TIM_UpdateSource);
void TIM_SelectHallSensor(uint32_t TIMx, FunctionalState NewState);
void TIM_SelectOnePulseMode(uint32_t TIMx, uint16_t TIM_OPMode);
void TIM_SelectOutputTrigger(uint32_t TIMx, uint16_t TIM_TRGOSource);
void TIM_SelectSlaveMode(uint32_t TIMx, uint16_t TIM_SlaveMode);
void TIM_SelectMasterSlaveMode(uint32_t TIMx, uint16_t TIM_MasterSlaveMode);
void TIM_SetCounter(uint32_t TIMx, uint16_t Counter);
void TIM_SetAutoreload(uint32_t TIMx, uint16_t Autoreload);
void TIM_SetCompare1(uint32_t TIMx, uint16_t Compare1);
void TIM_SetCompare2(uint32_t TIMx, uint16_t Compare2);
void TIM_SetCompare3(uint32_t TIMx, uint16_t Compare3);
void TIM_SetCompare4(uint32_t TIMx, uint16_t Compare4);
void TIM_SetIC1Prescaler(uint32_t TIMx, uint16_t TIM_ICPSC);
void TIM_SetIC2Prescaler(uint32_t TIMx, uint16_t TIM_ICPSC);
void TIM_SetIC3Prescaler(uint32_t TIMx, uint16_t TIM_ICPSC);
void TIM_SetIC4Prescaler(uint32_t TIMx, uint16_t TIM_ICPSC);
void TIM_SetClockDivision(uint32_t TIMx, uint16_t TIM_CKD);
uint16_t TIM_GetCapture1(uint32_t TIMx);
uint16_t TIM_GetCapture2(uint32_t TIMx);
uint16_t TIM_GetCapture3(uint32_t TIMx);
uint16_t TIM_GetCapture4(uint32_t TIMx);
uint16_t TIM_GetCounter(uint32_t TIMx);
uint16_t TIM_GetPrescaler(uint32_t TIMx);
FlagStatus TIM_GetFlagStatus(uint32_t TIMx, uint16_t TIM_FLAG);
void TIM_ClearFlag(uint32_t TIMx, uint16_t TIM_FLAG);
ITStatus TIM_GetITStatus(uint32_t TIMx, uint16_t TIM_IT);
void TIM_ClearITPendingBit(uint32_t TIMx, uint16_t TIM_IT);

#ifdef __cplusplus
}
#endif

#endif 

/***********************END OF FILE****/
